app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if Upload.all.length > 0
      @upload = Upload.find(1)

SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @upload = Upload.find(params[:id])

INSERT INTO "uploads" ("title", "file_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["file_name", "The Weeknd - Starboy (Lyric Video) ft. Daft Punk.mp3"], ["user_id", 4], ["created_at", 2016-11-25 23:54:16 UTC], ["updated_at", 2016-11-25 23:54:16 UTC]]
---
  def create
    @upload = Upload.new(title: params[:upload][:title],
                            file_name: params[:upload][:file_info].original_filename,
                            user_id: current_user.id)
    if @upload.save