app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "uploads".* FROM "uploads"
SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @user = User.new(user_params)
    if @user.save
      session[:user_id] = @user.id
      if Upload.all.length > 0
        @upload = Upload.find(1)