app/views/uploads/show.html.erb

SELECT "uploads".* FROM "uploads"
---
                <li class="dropdown-header">Playlist 1</li>
                <% Upload.all.each do |upload| %>